In [1]:
import pandas as pd

In [ ]:
pd.merge?

In [10]:
df_temp = pd.DataFrame({
    'city': ['Lahore', 'Muree', 'Peshawer', 'Sialkot'],
    'temperature' : [39, 14, 29, 32],
})
df_temp

       city  temperature
0    Lahore           39
1     Muree           14
2  Peshawer           29
3   Sialkot           32

In [4]:
df_hum = pd.DataFrame({
    'city': [ 'Karachi', 'Lahore', 'Peshawer', 'Lahore', 'Muree'],
    'humidity' : [76, 95, 72, 70, 75],
})
df_hum

       city  humidity
0   Karachi        76
1    Lahore        95
2  Peshawer        72
3    Lahore        70
4     Muree        75

In [6]:
pd.merge(df_temp, df_hum, how='inner', on='city', indicator=True)

       city  temperature  humidity _merge
0    Lahore           39        95   both
1    Lahore           39        70   both
2     Muree           14        75   both
3  Peshawer           29        72   both

In [8]:
pd.merge(df_temp, df_hum)

       city  temperature  humidity
0    Lahore           39        95
1    Lahore           39        70
2     Muree           14        75
3  Peshawer           29        72

In [17]:
df1 = pd.DataFrame({'col1': ['a', 'b', 'c', 'b'], 'col2': [1, 2, 3, 4], 'col3': [6, 3, 2, 5]})
df2 = pd.DataFrame({'col1': ['a', 'b', 'c', 'b'], 'col2': [1, 2, 9, 4], 'col4': [6, 3, 2, 5]})

pd.merge(df1, df2, on=['col1', 'col2'])

  col1  col2  col3  col4
0    a     1     6     6
1    b     2     3     3
2    b     4     5     5

In [7]:
pd.merge(df_hum, df_temp, how='outer', on='city', indicator=True)

       city  humidity  temperature      _merge
0   Karachi      76.0          NaN   left_only
1    Lahore      95.0         39.0        both
2    Lahore      70.0         39.0        both
3  Peshawer      72.0         29.0        both
4     Muree      75.0         14.0        both
5   Sialkot       NaN         32.0  right_only

In [19]:
pd.merge(df_temp, df_hum, how='left', on='city', indicator=True)

       city  temperature  humidity     _merge
0    Lahore           39      95.0       both
1    Lahore           39      70.0       both
2     Muree           14      75.0       both
3  Peshawer           29      72.0       both
4   Sialkot           32       NaN  left_only

In [21]:
pd.merge(df_hum, df_temp, how='right', on='city', indicator=True)

       city  humidity  temperature      _merge
0    Lahore      95.0           39        both
1    Lahore      70.0           39        both
2     Muree      75.0           14        both
3  Peshawer      72.0           29        both
4   Sialkot       NaN           32  right_only

In [ ]:
pd.concat?

In [ ]:
pd.DataFrame.append?